<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [49]:
import pandas as pd
import psycopg2

In [50]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [51]:
connection = psycopg2.connect(
    dbname=DBname,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [52]:
# текст запроса
query_3_1 = f'''
            SELECT COUNT(*) vac_count
            FROM vacancies
'''

In [53]:
# результат запроса
display(pd.read_sql_query(query_3_1, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\3751129183.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_3_1, connection))

   vac_count
0      49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [54]:
# текст запроса
query_3_2 = f'''
            SELECT COUNT(*) empl_count
            FROM employers
'''

In [55]:
# результат запроса
display(pd.read_sql_query(query_3_2, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\2158789556.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_3_2, connection))

   empl_count
0       23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [56]:
# текст запроса
query_3_3 = f'''
            SELECT COUNT(*) areas_count
            FROM areas
'''

In [57]:
# результат запроса
display(pd.read_sql_query(query_3_3, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\366161583.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_3_3, connection))

   areas_count
0         1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [58]:
# текст запроса
query_3_4 = f'''
            SELECT COUNT(*) ind_count
            FROM industries
'''

In [59]:
# результат запроса
display(pd.read_sql_query(query_3_4, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\3955678470.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_3_4, connection))

   ind_count
0        294

***

#### выводы по предварительному анализу данных
В общей массе количество вакансий в около двух раз больше, чем количество работодателей. Либо все компании предлогают по 2-3 вакансии, что маловероятно. Либо в базе присутсвуют как крупные работодатели, которые могут предлагать десятки вакансий, так и компании, которые в данный момент не ищут сотрудников.  
По количеству регионов, данные, как минимум, должны охватывать всю Россию.  
Также данные имеют широкий охват по сферам деятельности (выборка не направлена на какую-то конкретную область).

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [60]:
# текст запроса
query_4_1 = f'''
            SELECT
                a.name area,
                COUNT(v.id) cnt
            FROM vacancies v
            JOIN areas a ON a.id = v.area_id
            GROUP BY a.name
            ORDER BY cnt DESC
'''

In [61]:
# результат запроса
display(pd.read_sql_query(query_4_1, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\2583321326.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_4_1, connection))

                area   cnt
0             Москва  5333
1    Санкт-Петербург  2851
2              Минск  2112
3        Новосибирск  2006
4             Алматы  1892
..               ...   ...
764       Тарко-Сале     1
765    Новоаннинский     1
766            Бирск     1
767           Сасово     1
768             Анна     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [62]:
query_4_2 = f'''
            SELECT
                COUNT(id) notnull_salary_cnt
            FROM vacancies
            WHERE (salary_from IS NOT NULL) OR (salary_to IS NOT NULL)
'''

In [63]:
# результат запроса
display(pd.read_sql_query(query_4_2, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\1696731027.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_4_2, connection))

   notnull_salary_cnt
0               24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [64]:
# текст запроса
query_4_3 = f'''
            SELECT
                ROUND(AVG(salary_from)) avg_sal_from,
                ROUND(AVG(salary_to)) avg_sal_to
            FROM vacancies
'''

In [65]:
# результат запроса
display(pd.read_sql_query(query_4_3, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\1295814676.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_4_3, connection))

   avg_sal_from  avg_sal_to
0       71065.0    110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [66]:
# текст запроса
query_4_4 = f'''
            SELECT
                schedule,
                employment,
                COUNT(id) vac_cnt
            FROM vacancies
            GROUP BY
                schedule,
                employment
            ORDER BY vac_cnt DESC
'''

In [67]:
# результат запроса
display(pd.read_sql_query(query_4_4, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\844525394.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_4_4, connection))

            schedule           employment  vac_cnt
0        Полный день     Полная занятость    35367
1   Удаленная работа     Полная занятость     7802
2      Гибкий график     Полная занятость     1593
3   Удаленная работа  Частичная занятость     1312
4     Сменный график     Полная занятость      940
5        Полный день           Стажировка      569
6     Вахтовый метод     Полная занятость      367
7        Полный день  Частичная занятость      347
8      Гибкий график  Частичная занятость      312
9        Полный день     Проектная работа      141
10  Удаленная работа     Проектная работа      133
11     Гибкий график           Стажировка      116
12    Сменный график  Частичная занятость      101
13  Удаленная работа           Стажировка       64
14     Гибкий график     Проектная работа       18
15    Сменный график           Стажировка       12
16    Вахтовый метод     Проектная работа        2
17    Сменный график     Проектная работа        1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [68]:
# текст запроса
query_4_5 = f'''
            SELECT
                experience
            FROM vacancies
            GROUP BY
                experience
            ORDER BY COUNT(id)
'''

In [69]:
# результат запроса
display(pd.read_sql_query(query_4_5, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\4208118522.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_4_5, connection))

           experience
0         Более 6 лет
1           Нет опыта
2       От 3 до 6 лет
3  От 1 года до 3 лет

***

#### выводы по детальному анализу вакансий

Закономерно, что большинство вакансий предлагается в крупных городах (не только России, Минск также входит в пятерку лидеров), где сосредоточено большинство компаний. Интересно, что для половины вакансий не указана предлагаемая зараплата. Возможно эта информация скрыта в опистельной части данных или предполагается договорная зарплата по результатам собеседования.  

Большинство вакансий относится к полному дню и полной занятости, т.е. предполагают основную работу в штате компании. Также не малая часть вакансий относится к удаленной работе в штате. Но также представлены, хоть и в меньшей степени, и все другие варианты графиков, т.е. представленные вакансии могут удовлетворить широкий уровень запросов.  

Большая часть работодателей готовы принимать со стажем 1-3 года, но на рынке представлены вакансии в широком диапазоне требуемого стажа.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [70]:
# текст запроса
query_5_1 = f'''
            SELECT
                e.name
            FROM employers e
            JOIN vacancies v ON e.id = v.employer_id
            GROUP BY e.id
            ORDER BY COUNT(v.id) DESC
            LIMIT 5
            
'''

In [71]:
# результат запроса
display(pd.read_sql_query(query_5_1, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\2151444398.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_1, connection))

            name
0         Яндекс
1     Ростелеком
2       Тинькофф
3           СБЕР
4  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [72]:
# текст запроса
query_5_2 = f'''
            SELECT
                a.name,
                COUNT(DISTINCT e.id) empl_cnt,
                COUNT(DISTINCT v.id) vac_cnt
            FROM areas a
            LEFT JOIN vacancies v ON a.id = v.area_id
            LEFT JOIN employers e ON a.id = e.area
            GROUP BY a.id                
            ORDER BY vac_cnt, empl_cnt DESC
'''

In [73]:
# результат запроса
display(pd.read_sql_query(query_5_2, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\862188055.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_2, connection))

                    name  empl_cnt  vac_cnt
0                 Россия       410        0
1              Казахстан       207        0
2     Московская область        75        0
3     Краснодарский край        19        0
4     Ростовская область        18        0
...                  ...       ...      ...
1357              Алматы       721     1892
1358         Новосибирск       573     2006
1359               Минск      1115     2112
1360     Санкт-Петербург      2217     2851
1361              Москва      5864     5333

[1362 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [74]:
# текст запроса
query_5_3 = f'''
            SELECT
                e.name,
                COUNT(DISTINCT v.area_id) area_cnt
            FROM employers e
            JOIN vacancies v ON e.id = v.employer_id
            GROUP BY v.employer_id, e.name              
            ORDER BY 2 DESC
'''

In [75]:
# результат запроса
display(pd.read_sql_query(query_5_3, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\685700059.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_3, connection))

                                         name  area_cnt
0                                      Яндекс       181
1                                  Ростелеком       152
2                                  Спецремонт       116
3                      Поляков Денис Иванович        88
4                                   ООО ЕФИН         71
...                                       ...       ...
14901                            НПП Авиатрон         1
14902              Центр дистанционных торгов         1
14903  Городские Телекоммуникационные Системы         1
14904                       Введенский, Отель         1
14905              Группа Компаний Автоимпорт         1

[14906 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [76]:
# текст запроса
query_5_4 = f'''
            SELECT
                COUNT(*)
            FROM employers
            LEFT JOIN employers_industries ON id = employer_id
            WHERE employer_id IS NULL
'''

In [77]:
# результат запроса
display(pd.read_sql_query(query_5_4, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\3895038198.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_4, connection))

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [78]:
# текст запроса
query_5_5 = f'''
            SELECT
                name
            FROM employers
            JOIN employers_industries ON id = employer_id
            GROUP BY employer_id, name
            HAVING COUNT(industry_id) = 4
            ORDER BY 1
            OFFSET 2
            LIMIT 1
'''

In [79]:
# результат запроса
display(pd.read_sql_query(query_5_5, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\200873132.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_5, connection))

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [80]:
# текст запроса
query_5_6 = f'''
            SELECT
                COUNT(employer_id)
            FROM employers_industries
            JOIN industries ON id = industry_id
            WHERE name = 'Разработка программного обеспечения'
'''

In [81]:
# результат запроса
display(pd.read_sql_query(query_5_6, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\1021402873.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_6, connection))

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [82]:
# код для получения списка городов-милионников

import requests
from bs4 import BeautifulSoup

url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России'
response = requests.get(url)
page = BeautifulSoup(response.text, 'html.parser')

# Поиск проводится по ссылкам
# Находим первую ссылку с текстом "Москва" и начиная с нее берем 16 позиций
links = page.find_all('a')
for i, link in enumerate(links):
    if link.text == 'Москва':
        million_cities_list = [link.text for link in links[i: i + 16]]
        pass

print(million_cities_list)

['Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Красноярск', 'Челябинск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Краснодар', 'Омск', 'Воронеж', 'Пермь', 'Волгоград']

In [83]:
# текст запроса

# Часть запроса для отбора по городам-миллионниками
where_query = "' OR a.name = '".join(million_cities_list)

query_5_7 = f'''
            SELECT
                a.name,
                COUNT(v.id) cnt
            FROM vacancies v
            JOIN employers e ON v.employer_id = e.id
            JOIN areas a ON v.area_id = a.id
            WHERE e.name = 'Яндекс' AND (a.name = '{where_query}')
            GROUP BY a.name
            UNION
            SELECT
                'Total',
                COUNT(v.id) cnt
            FROM vacancies v
            JOIN employers e ON v.employer_id = e.id
            JOIN areas a ON v.area_id = a.id
            WHERE e.name = 'Яндекс' AND (a.name = '{where_query}')
            ORDER BY 2
'''

In [84]:
# результат запроса
display(pd.read_sql_query(query_5_7, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\2286062676.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_7, connection))

               name  cnt
0              Омск   21
1         Челябинск   22
2        Красноярск   23
3         Волгоград   24
4             Пермь   25
5            Казань   25
6    Ростов-на-Дону   25
7               Уфа   26
8            Самара   26
9         Краснодар   30
10          Воронеж   32
11      Новосибирск   35
12  Нижний Новгород   36
13     Екатеринбург   39
14  Санкт-Петербург   42
15           Москва   54
16            Total  485

***

#### выводы по анализу работодателей

Большая часть вакансий относится к крупным компаниям, которые тесно связаны с IT сферой. Их вакансии представлены в различных регионах.  

Более мелкие и не самые изестные работодатели также пользуются способом размещения вакансий в ненскольких регионах, но, можно предположить, что это делается для более широкого охвата кандидатов, чем для предложения работы в каждом представленном регионе (нужно проверять).

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [85]:
# текст запроса
query_6_1 = f'''
            SELECT
                COUNT(*)
            FROM vacancies
            WHERE LOWER(name) LIKE '%data%'
                OR LOWER(name) LIKE '%данн%'
'''

In [86]:
# результат запроса
display(pd.read_sql_query(query_6_1, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\3453984721.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_1, connection))

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [87]:
# текст запроса

# условие будет использовано во всех последующих запросах
ds_vacancies = "(LOWER(vacancies.name) LIKE '%data scientist%' " \
                + "OR LOWER(vacancies.name) LIKE '%data science%' " \
                + "OR LOWER(vacancies.name) LIKE '%исследователь данных%' " \
                + "OR (vacancies.name LIKE '%ML%' AND vacancies.name NOT LIKE '%HTML%') " \
                + "OR LOWER(vacancies.name) LIKE '%machine learning%' " \
                + "OR LOWER(vacancies.name) LIKE '%машинн%обучен%')"

junior_vacancies = "(LOWER(vacancies.name) LIKE '%junior%' " \
                + "OR experience = 'Нет опыта' " \
                + "OR employment = 'Стажировка')"

query_6_2 = f'''
            SELECT
                COUNT(*)
            FROM vacancies
            WHERE {ds_vacancies} AND {junior_vacancies}
'''

In [88]:
# результат запроса
display(pd.read_sql_query(query_6_2, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\953831705.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_2, connection))

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [89]:
# текст запроса
query_6_3 = f'''
            SELECT
                COUNT(*)
            FROM vacancies
            WHERE {ds_vacancies}
                AND (key_skills LIKE '%SQL%'
                    OR key_skills LIKE 'postgres')
'''

In [90]:
# результат запроса
display(pd.read_sql_query(query_6_3, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\780659738.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_3, connection))

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [91]:
# текст запроса
query_6_4 = f'''
            SELECT
                COUNT(*)
            FROM vacancies
            WHERE {ds_vacancies}
                AND key_skills LIKE '%Python%'
'''

In [92]:
# результат запроса
display(pd.read_sql_query(query_6_4, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\451669187.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_4, connection))

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [93]:
# текст запроса
query_6_5 = f'''
            SELECT
                ROUND(AVG(LENGTH(key_skills) - LENGTH(REPLACE(key_skills,CHR(9),'')) + 1),2)
            FROM vacancies
            WHERE {ds_vacancies} AND key_skills IS NOT NULL
'''

In [94]:
# результат запроса
display(pd.read_sql_query(query_6_5, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\3375502323.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_5, connection))

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [95]:
# текст запроса
query_6_6 = f'''
            SELECT
                experience,
                ROUND(AVG(COALESCE((salary_from + salary_to) / 2,
                                salary_from,
                                salary_to
                                )
                        )   
                )
            FROM vacancies
            WHERE {ds_vacancies} AND (salary_from IS NOT NULL OR salary_to IS NOT NULL)
            GROUP BY experience
'''

In [96]:
# результат запроса
display(pd.read_sql_query(query_6_6, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\664293845.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_6, connection))

           experience     round
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

#### выводы по предметному анализу

Около нескольких сотен вакансий относится в сфере DataScience. При чем, для занятия должности требуется владение в среднем около 6 различными навыками, влкючая SQL и Python.  

Предлагаемая зарплата увеличивается в разы при наличии опыта работы, а стартует в среднем от 75000 р.

# Общий вывод по проекту

Направление цифровых, информационных технологий активно развивается, что отражается в том числе в количестве открытых вакансий по этим направлениям. Несмотря на то, что работа в этой области может вестись удаленно, все равно большая часть предложений на рынке труда имеет фиксацию по регионам, закономерно, что в первую очередь по крупным городам России и ближнего зарубежья.  
Из-за высокой потребности в развитии этих направлений компании предлагают конкурентные или даже выше средних заработные платы, а также готовы к привлечению специалистов с минимальным опытом работы.

In [97]:
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

# Дополнительные исследования

1. Определим наиболее популярные сферы деятельности компаний по количеству вакансий

In [98]:
# Топ по сферам деятельности
query_add_1 = f'''
            SELECT
                i.name,
                COUNT(*)
            FROM vacancies
            JOIN employers e ON vacancies.employer_id = e.id
            JOIN employers_industries ei ON e.id = ei.employer_id
            JOIN industries i ON ei.industry_id = i.id
            GROUP BY i.id, i.name
            ORDER BY 2 DESC
'''
display(pd.read_sql_query(query_add_1, connection))

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\2986557071.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_add_1, connection))

                                                  name  count
0                  Разработка программного обеспечения  12499
1    Системная интеграция,  автоматизации технологи...  11034
2    Интернет-компания (поисковики, платежные систе...   6413
3                                                 Банк   2742
4                                      Мобильная связь   1585
..                                                 ...    ...
288                               Спортивная федерация      5
289                                          Химчистка      4
290             Ассоциация в сфере культуры, искусства      2
291                                  Ритуальные услуги      1
292                                          Автошкола      1

[293 rows x 2 columns]

2. Определим топ-20 компаний по количеству вакансий, где востребованы специалисты DataScience

In [99]:

# Топ 20 компаний по количеству вакансий, где востребовано направление DataScience
query_add_2 = f'''
            SELECT
                COUNT(*) "Количество DS вакансий",
                e.name "Компания"
            FROM vacancies
            JOIN employers e ON vacancies.employer_id = e.id
            WHERE {ds_vacancies}
            GROUP BY e.id, e.name
            ORDER BY 1 DESC
            LIMIT 20
'''
display(pd.read_sql_query(query_add_2, connection))
connection.close()

C:\Users\Admin\AppData\Local\Temp\ipykernel_984\1658794726.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_add_2, connection))

    Количество DS вакансий                           Компания
0                       37                               СБЕР
1                       25                    Bell Integrator
2                       18                     Банк ВТБ (ПАО)
3                       15                                 VK
4                       11              Positive Technologies
5                        9                             Яндекс
6                        9                     EvenBet Gaming
7                        8                            МегаФон
8                        7                           Andersen
9                        6                 Бэнкс Софт Системс
10                       6                               Ozon
11                       6                                МТС
12                       6                             Контур
13                       5                               2ГИС
14                       5                        Спортмастер
15                       5  Лента, федеральная розничная сеть
16                       5                           inDriver
17                       5                        Газпромбанк
18                       5           Иннотех, Группа компаний
19                       4                           Тинькофф